FSAndDisk_Test/FS_Disk_SSD_p4800x_NVMe_scripts/P4800x_fs_fio_test_read_ranseq/rand_read_block_32K_64_4_jobs.out
rand_read_test: (g=0): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=64
...
fio-3.28
Starting 4 processes

rand_read_test: (groupid=0, jobs=4): err= 0: pid=2339191: Mon May 13 20:22:34 2024
  read: IOPS=74.7k, BW=2336MiB/s (2449MB/s)(200GiB/87678msec)
    slat (usec): min=3, max=6151, avg=13.22, stdev= 6.04
    clat (usec): min=402, max=11466, avg=3340.14, stdev=537.89
     lat (usec): min=413, max=11529, avg=3353.51, stdev=538.70
    clat percentiles (usec):
     |  1.00th=[ 2442],  5.00th=[ 2474], 10.00th=[ 3261], 20.00th=[ 3261],
     | 30.00th=[ 3261], 40.00th=[ 3261], 50.00th=[ 3294], 60.00th=[ 3294],
     | 70.00th=[ 3294], 80.00th=[ 3294], 90.00th=[ 3326], 95.00th=[ 4883],
     | 99.00th=[ 5735], 99.50th=[ 5800], 99.90th=[ 6128], 99.95th=[ 6390],
     | 99.99th=[ 7635]
   bw (  MiB/s): min= 1595, max= 3196, per=100.00%, avg=2389.32, stdev=64.43, samples=686
   iops        : min=51052, max=102296, avg=76458.12, stdev=2061.91, samples=686
  lat (usec)   : 500=0.02%, 750=0.09%, 1000=0.07%
  lat (msec)   : 2=0.29%, 4=93.91%, 10=5.61%, 20=0.01%
  cpu          : usr=12.35%, sys=34.80%, ctx=6490718, majf=0, minf=3039
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=6553600,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=2336MiB/s (2449MB/s), 2336MiB/s-2336MiB/s (2449MB/s-2449MB/s), io=200GiB (215GB), run=87678-87678msec

Disk stats (read/write):
  nvme5n1: ios=6802576/0, merge=0/0, ticks=23181068/0, in_queue=23181068, util=100.00%