FSAndDisk_Test/FS_Disk_SSD_p4800x_NVMe_scripts/P4800x_fs_fio_test_read_ranseq/rand_read_block_4M_2_8_jobs.out
rand_read_test: (g=0): rw=randread, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=2
...
fio-3.28
Starting 8 processes

rand_read_test: (groupid=0, jobs=8): err= 0: pid=2601038: Mon May 13 22:32:50 2024
  read: IOPS=138, BW=552MiB/s (579MB/s)(200GiB/370708msec)
    slat (usec): min=156, max=5089, avg=583.84, stdev=146.22
    clat (msec): min=15, max=570, avg=68.89, stdev=59.36
     lat (msec): min=16, max=570, avg=69.47, stdev=59.36
    clat percentiles (msec):
     |  1.00th=[   32],  5.00th=[   35], 10.00th=[   35], 20.00th=[   39],
     | 30.00th=[   41], 40.00th=[   42], 50.00th=[   47], 60.00th=[   53],
     | 70.00th=[   69], 80.00th=[   83], 90.00th=[  118], 95.00th=[  188],
     | 99.00th=[  359], 99.50th=[  388], 99.90th=[  426], 99.95th=[  472],
     | 99.99th=[  510]
   bw (  MiB/s): min=  351, max= 2007, per=100.00%, avg=1034.83, stdev=53.76, samples=3550
   iops        : min=   87, max=  501, avg=257.91, stdev=13.43, samples=3550
  lat (msec)   : 20=0.17%, 50=56.67%, 100=29.56%, 250=10.92%, 500=2.66%
  lat (msec)   : 750=0.02%
  cpu          : usr=0.04%, sys=1.77%, ctx=51629, majf=0, minf=16642
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=51200,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2

Run status group 0 (all jobs):
   READ: bw=552MiB/s (579MB/s), 552MiB/s-552MiB/s (579MB/s-579MB/s), io=200GiB (215GB), run=370708-370708msec

Disk stats (read/write):
  nvme5n1: ios=7647469/0, merge=6397/0, ticks=733119923/0, in_queue=733119923, util=100.00%